# SetWallWidth

## Description
Procedure SetWallWidth sets the default wall width of the document.

```pascal
PROCEDURE SetWallWidth(widthDistance : REAL);
```

```python
def vs.SetWallWidth(widthDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widthDistance|REAL|New default wall width.|

## Version
SetWallWidth is obsolete as of VectorWorks12.0<P>

Availability: from MiniCAD6.0

## Category
* Objects - Walls